app/Controllers/ProductController.php

INSERT INTO `products` (`nama_product`, `description`) VALUES ('Widi', 'teman saya')
---
    public function insertProduct() {
        if ($this->request->getMethod() === 'post') {
            $validationRules = [
                'nama_product' => 'required',
                'description' => 'required',
            ];

            if ($this->validate($validationRules)) {
                $data = [
                    'nama_product' => $this->request->getPost('nama_product'),
                    'description' => $this->request->getPost('description'),
                ];

                $this->product->insert($data);

SELECT *
FROM `products`
---
    public function readProduct(){
        $products = $this->product->findAll();

DELETE FROM `products`
WHERE `id` IN ('7')
---
    public function deleteProduct($id) {
        $this->product->delete($id);

SELECT *
FROM `products`
---
    public function readProductApi(){
        $products = $this->product->findAll();