app/Controllers/ProductController.php

UPDATE `products` SET `nama_product` = 'Ewew', `description` = 'OWOW'
WHERE `products`.`id` IN ('10')
---
    public function updateProductApi($id) {
        $requestData = $this->request->getJSON();

        $validation = $this->validate([
            'nama_product' => 'required',
            'description' => 'required',
        ]);

        if (!$validation) {
            $this->response->setStatusCode(400);
            return $this->response->setJSON([
                'code'=> 400,
                'status'=> 'BAD REQUEST',
                'data' => 'null'
            ]);
        }

        $data = [
            'nama_product' => $requestData->nama_product,
            'description' => $requestData->description,
        ];

        $update = $this->product->update($id, $data);

DELETE FROM `products`
WHERE `id` IN ('8')
---
    public function deleteProduct($id) {
        $this->product->delete($id);

DELETE FROM `products`
WHERE `id` IN ('10')
---
    public function deleteProductApi($id) {
        // Assuming you have a deleteProduct method in your model to handle deletion
        $delete = $this->product->delete($id);