app/Models/ProductModel.php

INSERT INTO `products` (`nama_product`, `description`) VALUES ('Semangka', 'Berasal dari bali')
---
    public function insertProductORM($data){
        return $this->insert($data);